awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/Drivers/CMSIS/Device/PY32F0xx/Include/py32f033x8.h
/********************************* Bit definition for FLASH_TS1 register ********************************************/
#define FLASH_TS1_TS1_Pos                         (0U)
#define FLASH_TS1_TS1_Msk                         (0xFFUL<<FLASH_TS1_TS1_Pos)                       /*!< 0x000000FF */
#define FLASH_TS1_TS1                             FLASH_TS1_TS1_Msk                                 /*!< TS1 */

/********************************* Bit definition for FLASH_TS2P register *******************************************/
#define FLASH_TS2P_TS2P_Pos                       (0U)
#define FLASH_TS2P_TS2P_Msk                       (0xFFUL<<FLASH_TS2P_TS2P_Pos)                     /*!< 0x000000FF */
#define FLASH_TS2P_TS2P                           FLASH_TS2P_TS2P_Msk                               /*!< TS2P */

/********************************* Bit definition for FLASH_TPS3 register *******************************************/
#define FLASH_TPS3_TPS3_Pos                       (0U)
#define FLASH_TPS3_TPS3_Msk                       (0x3FFUL<<FLASH_TPS3_TPS3_Pos)                    /*!< 0x000003FF */
#define FLASH_TPS3_TPS3                           FLASH_TPS3_TPS3_Msk                               /*!< TPS3 */

/********************************* Bit definition for FLASH_TS3 register ********************************************/
#define FLASH_TS3_TS3_Pos                         (0U)
#define FLASH_TS3_TS3_Msk                         (0xFFUL<<FLASH_TS3_TS3_Pos)                       /*!< 0x000000FF */
#define FLASH_TS3_TS3                             FLASH_TS3_TS3_Msk                                 /*!< TS3 */

/********************************* Bit definition for FLASH_ERSTPE register *****************************************/
#define FLASH_ERSTPE_ERSTPE_Pos                   (0U)
#define FLASH_ERSTPE_ERSTPE_Msk                   (0xFFFFUL<<FLASH_ERSTPE_ERSTPE_Pos)               /*!< 0x0000FFFF */
#define FLASH_ERSTPE_ERSTPE                       FLASH_ERSTPE_ERSTPE_Msk                           /*!< ERSTPE */

/********************************* Bit definition for FLASH_PRGTPE register *****************************************/
#define FLASH_PRGTPE_PRGTPE_Pos                   (0U)
#define FLASH_PRGTPE_PRGTPE_Msk                   (0xFFFFUL<<FLASH_PRGTPE_PRGTPE_Pos)               /*!< 0x0000FFFF */
#define FLASH_PRGTPE_PRGTPE                       FLASH_PRGTPE_PRGTPE_Msk                           /*!< PRGTPE */

/********************************* Bit definition for FLASH_PRETPE register *****************************************/
#define FLASH_PRETPE_PRETPE_Pos                   (0U)
#define FLASH_PRETPE_PRETPE_Msk                   (0x1FFFUL<<FLASH_PRETPE_PRETPE_Pos)               /*!< 0x00001FFF */
#define FLASH_PRETPE_PRETPE                       FLASH_PRETPE_PRETPE_Msk                           /*!< PRETPE */

/********************************* Bit definition for FLASH_ACLK2PW register ****************************************/
#define FLASH_ACLK2PW_TACLK2PW_Pos                (0U)
#define FLASH_ACLK2PW_TACLK2PW_Msk                (0x1FUL<<FLASH_ACLK2PW_TACLK2PW_Pos)              /*!< 0x0000001F */
#define FLASH_ACLK2PW_TACLK2PW                    FLASH_ACLK2PW_TACLK2PW_Msk                        /*!< TACLK2PW */
#define FLASH_ACLK2PW_TACLK2PW_0                  (0x1UL<<FLASH_ACLK2PW_TACLK2PW_Pos)               /*!< 0x00000001 */
#define FLASH_ACLK2PW_TACLK2PW_1                  (0x2UL<<FLASH_ACLK2PW_TACLK2PW_Pos)               /*!< 0x00000002 */
#define FLASH_ACLK2PW_TACLK2PW_2                  (0x4UL<<FLASH_ACLK2PW_TACLK2PW_Pos)               /*!< 0x00000004 */
#define FLASH_ACLK2PW_TACLK2PW_3                  (0x8UL<<FLASH_ACLK2PW_TACLK2PW_Pos)               /*!< 0x00000008 */
#define FLASH_ACLK2PW_TACLK2PW_4                  (0x10UL<<FLASH_ACLK2PW_TACLK2PW_Pos)              /*!< 0x00000010 */

/********************************************************************************************************************/
/********************************* GPIO *****************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for GPIO_MODER register *******************************************/
#define GPIO_MODER_MODE0_Pos                     (0U)
#define GPIO_MODER_MODE0_Msk                     (0x3UL<<GPIO_MODER_MODE0_Pos)                    /*!< 0x00000003 */
#define GPIO_MODER_MODE0                         GPIO_MODER_MODE0_Msk                             /*!< GPIOA0 MODE */
#define GPIO_MODER_MODE0_0                       (0x1UL<<GPIO_MODER_MODE0_Pos)                    /*!< 0x00000001 */
#define GPIO_MODER_MODE0_1                       (0x2UL<<GPIO_MODER_MODE0_Pos)                    /*!< 0x00000002 */
#define GPIO_MODER_MODE1_Pos                     (2U)
#define GPIO_MODER_MODE1_Msk                     (0x3UL<<GPIO_MODER_MODE1_Pos)                    /*!< 0x0000000C */
#define GPIO_MODER_MODE1                         GPIO_MODER_MODE1_Msk                             /*!< GPIOA1 MODE */
#define GPIO_MODER_MODE1_0                       (0x1UL<<GPIO_MODER_MODE1_Pos)                    /*!< 0x00000004 */
#define GPIO_MODER_MODE1_1                       (0x2UL<<GPIO_MODER_MODE1_Pos)                    /*!< 0x00000008 */
#define GPIO_MODER_MODE2_Pos                     (4U)
#define GPIO_MODER_MODE2_Msk                     (0x3UL<<GPIO_MODER_MODE2_Pos)                    /*!< 0x00000030 */
#define GPIO_MODER_MODE2                         GPIO_MODER_MODE2_Msk                             /*!< GPIOA2 MODE */
#define GPIO_MODER_MODE2_0                       (0x1UL<<GPIO_MODER_MODE2_Pos)                    /*!< 0x00000010 */
#define GPIO_MODER_MODE2_1                       (0x2UL<<GPIO_MODER_MODE2_Pos)                    /*!< 0x00000020 */
#define GPIO_MODER_MODE3_Pos                     (6U)
#define GPIO_MODER_MODE3_Msk                     (0x3UL<<GPIO_MODER_MODE3_Pos)                    /*!< 0x000000C0 */
#define GPIO_MODER_MODE3                         GPIO_MODER_MODE3_Msk                             /*!< GPIOA3 MODE */
#define GPIO_MODER_MODE3_0                       (0x1UL<<GPIO_MODER_MODE3_Pos)                    /*!< 0x00000040 */
#define GPIO_MODER_MODE3_1                       (0x2UL<<GPIO_MODER_MODE3_Pos)                    /*!< 0x00000080 */
#define GPIO_MODER_MODE4_Pos                     (8U)
#define GPIO_MODER_MODE4_Msk                     (0x3UL<<GPIO_MODER_MODE4_Pos)                    /*!< 0x00000300 */
#define GPIO_MODER_MODE4                         GPIO_MODER_MODE4_Msk                             /*!< GPIOA4 MODE */
#define GPIO_MODER_MODE4_0                       (0x1UL<<GPIO_MODER_MODE4_Pos)                    /*!< 0x00000100 */
#define GPIO_MODER_MODE4_1                       (0x2UL<<GPIO_MODER_MODE4_Pos)                    /*!< 0x00000200 */
#define GPIO_MODER_MODE5_Pos                     (10U)
#define GPIO_MODER_MODE5_Msk                     (0x3UL<<GPIO_MODER_MODE5_Pos)                    /*!< 0x00000C00 */
#define GPIO_MODER_MODE5                         GPIO_MODER_MODE5_Msk                             /*!< GPIOA5 MODE */
#define GPIO_MODER_MODE5_0                       (0x1UL<<GPIO_MODER_MODE5_Pos)                    /*!< 0x00000400 */
#define GPIO_MODER_MODE5_1                       (0x2UL<<GPIO_MODER_MODE5_Pos)                    /*!< 0x00000800 */
#define GPIO_MODER_MODE6_Pos                     (12U)
#define GPIO_MODER_MODE6_Msk                     (0x3UL<<GPIO_MODER_MODE6_Pos)                    /*!< 0x00003000 */
#define GPIO_MODER_MODE6                         GPIO_MODER_MODE6_Msk                             /*!< GPIOA6 MODE */
#define GPIO_MODER_MODE6_0                       (0x1UL<<GPIO_MODER_MODE6_Pos)                    /*!< 0x00001000 */
#define GPIO_MODER_MODE6_1                       (0x2UL<<GPIO_MODER_MODE6_Pos)                    /*!< 0x00002000 */
#define GPIO_MODER_MODE7_Pos                     (14U)
#define GPIO_MODER_MODE7_Msk                     (0x3UL<<GPIO_MODER_MODE7_Pos)                    /*!< 0x0000C000 */
#define GPIO_MODER_MODE7                         GPIO_MODER_MODE7_Msk                             /*!< GPIOA7 MODE */
#define GPIO_MODER_MODE7_0                       (0x1UL<<GPIO_MODER_MODE7_Pos)                    /*!< 0x00004000 */
#define GPIO_MODER_MODE7_1                       (0x2UL<<GPIO_MODER_MODE7_Pos)                    /*!< 0x00008000 */
#define GPIO_MODER_MODE8_Pos                     (16U)
#define GPIO_MODER_MODE8_Msk                     (0x3UL<<GPIO_MODER_MODE8_Pos)                    /*!< 0x00030000 */
#define GPIO_MODER_MODE8                         GPIO_MODER_MODE8_Msk                             /*!< GPIOA8 MODE */
#define GPIO_MODER_MODE8_0                       (0x1UL<<GPIO_MODER_MODE8_Pos)                    /*!< 0x00010000 */
#define GPIO_MODER_MODE8_1                       (0x2UL<<GPIO_MODER_MODE8_Pos)                    /*!< 0x00020000 */
#define GPIO_MODER_MODE9_Pos                     (18U)
#define GPIO_MODER_MODE9_Msk                     (0x3UL<<GPIO_MODER_MODE9_Pos)                    /*!< 0x000C0000 */
#define GPIO_MODER_MODE9                         GPIO_MODER_MODE9_Msk                             /*!< GPIOA9 MODE */
#define GPIO_MODER_MODE9_0                       (0x1UL<<GPIO_MODER_MODE9_Pos)                    /*!< 0x00040000 */
#define GPIO_MODER_MODE9_1                       (0x2UL<<GPIO_MODER_MODE9_Pos)                    /*!< 0x00080000 */
#define GPIO_MODER_MODE10_Pos                    (20U)
#define GPIO_MODER_MODE10_Msk                    (0x3UL<<GPIO_MODER_MODE10_Pos)                   /*!< 0x00300000 */
#define GPIO_MODER_MODE10                        GPIO_MODER_MODE10_Msk                            /*!< GPIOA10 MODE */
#define GPIO_MODER_MODE10_0                      (0x1UL<<GPIO_MODER_MODE10_Pos)                   /*!< 0x00100000 */
#define GPIO_MODER_MODE10_1                      (0x2UL<<GPIO_MODER_MODE10_Pos)                   /*!< 0x00200000 */
#define GPIO_MODER_MODE11_Pos                    (22U)
#define GPIO_MODER_MODE11_Msk                    (0x3UL<<GPIO_MODER_MODE11_Pos)                   /*!< 0x00C00000 */
#define GPIO_MODER_MODE11                        GPIO_MODER_MODE11_Msk                            /*!< GPIOA11 MODE */
#define GPIO_MODER_MODE11_0                      (0x1UL<<GPIO_MODER_MODE11_Pos)                   /*!< 0x00400000 */
#define GPIO_MODER_MODE11_1                      (0x2UL<<GPIO_MODER_MODE11_Pos)                   /*!< 0x00800000 */
#define GPIO_MODER_MODE12_Pos                    (24U)
#define GPIO_MODER_MODE12_Msk                    (0x3UL<<GPIO_MODER_MODE12_Pos)                   /*!< 0x03000000 */
#define GPIO_MODER_MODE12                        GPIO_MODER_MODE12_Msk                            /*!< GPIOA12 MODE */
#define GPIO_MODER_MODE12_0                      (0x1UL<<GPIO_MODER_MODE12_Pos)                   /*!< 0x01000000 */
#define GPIO_MODER_MODE12_1                      (0x2UL<<GPIO_MODER_MODE12_Pos)                   /*!< 0x02000000 */
#define GPIO_MODER_MODE13_Pos                    (26U)
#define GPIO_MODER_MODE13_Msk                    (0x3UL<<GPIO_MODER_MODE13_Pos)                   /*!< 0x0C000000 */
#define GPIO_MODER_MODE13                        GPIO_MODER_MODE13_Msk                            /*!< GPIOA13 MODE */
#define GPIO_MODER_MODE13_0                      (0x1UL<<GPIO_MODER_MODE13_Pos)                   /*!< 0x04000000 */
#define GPIO_MODER_MODE13_1                      (0x2UL<<GPIO_MODER_MODE13_Pos)                   /*!< 0x08000000 */
#define GPIO_MODER_MODE14_Pos                    (28U)
#define GPIO_MODER_MODE14_Msk                    (0x3UL<<GPIO_MODER_MODE14_Pos)                   /*!< 0x30000000 */
#define GPIO_MODER_MODE14                        GPIO_MODER_MODE14_Msk                            /*!< GPIOA14 MODE */
#define GPIO_MODER_MODE14_0                      (0x1UL<<GPIO_MODER_MODE14_Pos)                   /*!< 0x10000000 */
#define GPIO_MODER_MODE14_1                      (0x2UL<<GPIO_MODER_MODE14_Pos)                   /*!< 0x20000000 */
#define GPIO_MODER_MODE15_Pos                    (30U)
#define GPIO_MODER_MODE15_Msk                    (0x3UL<<GPIO_MODER_MODE15_Pos)                   /*!< 0xC0000000 */
#define GPIO_MODER_MODE15                        GPIO_MODER_MODE15_Msk                            /*!< GPIOA15 MODE */
#define GPIO_MODER_MODE15_0                      (0x1UL<<GPIO_MODER_MODE15_Pos)                   /*!< 0x40000000 */
#define GPIO_MODER_MODE15_1                      (0x2UL<<GPIO_MODER_MODE15_Pos)                   /*!< 0x80000000 */

/********************************* Bit definition for GPIO_OTYPER register ******************************************/
#define GPIO_OTYPER_OT0_Pos                       (0U)
#define GPIO_OTYPER_OT0_Msk                       (0x1UL<<GPIO_OTYPER_OT0_Pos)                      /*!< 0x00000001 */
#define GPIO_OTYPER_OT0                           GPIO_OTYPER_OT0_Msk                               /*!< GPIOA0 Output type */
#define GPIO_OTYPER_OT1_Pos                       (1U)
#define GPIO_OTYPER_OT1_Msk                       (0x1UL<<GPIO_OTYPER_OT1_Pos)                      /*!< 0x00000002 */
#define GPIO_OTYPER_OT1                           GPIO_OTYPER_OT1_Msk                               /*!< GPIOA1 Output type */
#define GPIO_OTYPER_OT2_Pos                       (2U)
#define GPIO_OTYPER_OT2_Msk                       (0x1UL<<GPIO_OTYPER_OT2_Pos)                      /*!< 0x00000004 */
#define GPIO_OTYPER_OT2                           GPIO_OTYPER_OT2_Msk                               /*!< GPIOA2 Output type */
#define GPIO_OTYPER_OT3_Pos                       (3U)
#define GPIO_OTYPER_OT3_Msk                       (0x1UL<<GPIO_OTYPER_OT3_Pos)                      /*!< 0x00000008 */
#define GPIO_OTYPER_OT3                           GPIO_OTYPER_OT3_Msk                               /*!< GPIOA3 Output type */
#define GPIO_OTYPER_OT4_Pos                       (4U)
#define GPIO_OTYPER_OT4_Msk                       (0x1UL<<GPIO_OTYPER_OT4_Pos)                      /*!< 0x00000010 */
#define GPIO_OTYPER_OT4                           GPIO_OTYPER_OT4_Msk                               /*!< GPIOA4 Output type */
#define GPIO_OTYPER_OT5_Pos                       (5U)
#define GPIO_OTYPER_OT5_Msk                       (0x1UL<<GPIO_OTYPER_OT5_Pos)                      /*!< 0x00000020 */
#define GPIO_OTYPER_OT5                           GPIO_OTYPER_OT5_Msk                               /*!< GPIOA5 Output type */
#define GPIO_OTYPER_OT6_Pos                       (6U)
#define GPIO_OTYPER_OT6_Msk                       (0x1UL<<GPIO_OTYPER_OT6_Pos)                      /*!< 0x00000040 */
#define GPIO_OTYPER_OT6                           GPIO_OTYPER_OT6_Msk                               /*!< GPIOA6 Output type */
#define GPIO_OTYPER_OT7_Pos                       (7U)
#define GPIO_OTYPER_OT7_Msk                       (0x1UL<<GPIO_OTYPER_OT7_Pos)                      /*!< 0x00000080 */
#define GPIO_OTYPER_OT7                           GPIO_OTYPER_OT7_Msk                               /*!< GPIOA7 Output type */
#define GPIO_OTYPER_OT8_Pos                       (8U)
#define GPIO_OTYPER_OT8_Msk                       (0x1UL<<GPIO_OTYPER_OT8_Pos)                      /*!< 0x00000100 */
#define GPIO_OTYPER_OT8                           GPIO_OTYPER_OT8_Msk                               /*!< GPIOA8 Output type */
#define GPIO_OTYPER_OT9_Pos                       (9U)
#define GPIO_OTYPER_OT9_Msk                       (0x1UL<<GPIO_OTYPER_OT9_Pos)                      /*!< 0x00000200 */
#define GPIO_OTYPER_OT9                           GPIO_OTYPER_OT9_Msk                               /*!< GPIOA9 Output type */
#define GPIO_OTYPER_OT10_Pos                      (10U)
#define GPIO_OTYPER_OT10_Msk                      (0x1UL<<GPIO_OTYPER_OT10_Pos)                     /*!< 0x00000400 */
#define GPIO_OTYPER_OT10                          GPIO_OTYPER_OT10_Msk                              /*!< GPIOA10 Output type */
#define GPIO_OTYPER_OT11_Pos                      (11U)
#define GPIO_OTYPER_OT11_Msk                      (0x1UL<<GPIO_OTYPER_OT11_Pos)                     /*!< 0x00000800 */
#define GPIO_OTYPER_OT11                          GPIO_OTYPER_OT11_Msk                              /*!< GPIOA11 Output type */
#define GPIO_OTYPER_OT12_Pos                      (12U)
#define GPIO_OTYPER_OT12_Msk                      (0x1UL<<GPIO_OTYPER_OT12_Pos)                     /*!< 0x00001000 */
#define GPIO_OTYPER_OT12                          GPIO_OTYPER_OT12_Msk                              /*!< GPIOA12 Output type */
#define GPIO_OTYPER_OT13_Pos                      (13U)
#define GPIO_OTYPER_OT13_Msk                      (0x1UL<<GPIO_OTYPER_OT13_Pos)                     /*!< 0x00002000 */
#define GPIO_OTYPER_OT13                          GPIO_OTYPER_OT13_Msk                              /*!< GPIOA13 Output type */
#define GPIO_OTYPER_OT14_Pos                      (14U)
#define GPIO_OTYPER_OT14_Msk                      (0x1UL<<GPIO_OTYPER_OT14_Pos)                     /*!< 0x00004000 */
#define GPIO_OTYPER_OT14                          GPIO_OTYPER_OT14_Msk                              /*!< GPIOA14 Output type */
#define GPIO_OTYPER_OT15_Pos                      (15U)
#define GPIO_OTYPER_OT15_Msk                      (0x1UL<<GPIO_OTYPER_OT15_Pos)                     /*!< 0x00008000 */
#define GPIO_OTYPER_OT15                          GPIO_OTYPER_OT15_Msk                              /*!< GPIOA15 Output type */
#define GPIO_OTYPER_REVERSE_Pos                   (16U)
#define GPIO_OTYPER_REVERSE_Msk                   (0xFFFFUL<<GPIO_OTYPER_REVERSE_Pos)               /*!< 0xFFFF0000 */
#define GPIO_OTYPER_REVERSE                       GPIO_OTYPER_REVERSE_Msk

